tourists = [
    (1, 'Игорь', 'Косточки', 'м', '16.09.1998', '89076584934', '1@mail.com'),
    (2, 'Мария', 'Столыпина', 'ж', '23.02.2002', '89762832108', '2@mail.com'),
    (3, 'Екатерина', 'Лебедева', 'ж', '16.08.2001', '89779122204', '3@mail.com'),
    (4, 'Пётр', 'Максимов', 'м', '10.10.1989', '89053796578', '4@mail.com'),
    (5, 'Артемий', 'Митрофанов', 'м', '16.06.1997', '89045018932', '5@mail.com'),
    (6, 'Виктория', 'Цветкова', 'ж', '29.03.2002', '89516651220', '6@mail.com'),
    (7, 'Матвей', 'Семенов', 'м', '21.03.2004', '89113497652', '7@mail.com'),
    (8, 'Александра', 'Иванова', 'ж', '14.03.1998', '89168598518', '8@mail.com'),
    (9, 'Даниил', 'Коновалов', 'м', '02.08.2002', '89683236497', '9@mail.com'),
    (10, 'Варвара', 'Терентьева', 'ж', '17.01.1998', '89681152700', '10@mail.com')
]

tours = [
    (1, 'ОГОННЬ!!!!111!!!1', 'Никарагуа', 'Манагуа', '21.03.2023', '18.06.2023', 1000.00),
    (2, 'Гвинейские туры', 'Гвинея', 'Конакри', '02.06.2023', '25.06.2023', 300.99),
    (3, 'Скидка на тур по камбоджи', 'Камбоджа', 'Пномпень', '20.04.2023', '20.05.2023', 1250.99),
    (4, 'ИСПАНЦЫ', 'Испания', 'Мадрид', '20.05.2023', '10.06.2023', 2500.90),
    (5, 'Колубийский тур', 'Колумбия', 'Богота', '25.09.2023', '25.10.2023', 1789.00),
    (6, 'Тур до Бухареста', 'Румыния', 'Бухарест', '30.05.2023', '30.07.2023', 2350.00),
    (7, 'Еврейская мечта', 'Израиль', 'Иерусалим', '29.06.2023', '30.06.2023', 5000.99),
    (8, 'Новозеландский тур', 'Новая Зеландия', 'Веллингтон', '20.03.2023', '30.03.2023', 7590.50),
    (9, 'Эстонский исторический тур', 'Эстония', 'Таллин', '28.02.2023', '29.05.2023', 780.99),
    (10, 'В поисках лепрекона', 'Ирландия', 'Дублин', '16.08.2023', '24.09.2023', 3000.80),
]

booking = [
    (1, 3, 2, '18.03.2023', 34),
    (2, 5, 6, '10.05.2023', 40),
    (3, 1, 9, '24.02.2023', 25),
    (4, 8, 4, '25.04.2023', 69),
    (5, 7, 5, '16.09.2023', 42),
    (6, 4, 10, '30.07.2023', 50),
    (7, 2, 7, '20.06.2023', 18),
    (8, 6, 8, '09.03.2023', 87),
    (9, 10, 3, '03.04.2023', 76),
    (10, 9, 10, '28.07.2023', 50),
]
